// 1. Создай файл `variables.ts` и объяви в нём переменные с типами `string`, `number`, и `boolean`. Скомпилируй файл в .js. 
// Прикрепи полученный результат;


// 2. Возьми любую простую функцию (можно из домашек по JS) и типизируй ее. 
// Задай правильные типы для аргументов и возвращаемого значения. Скомпилируй файл в .js. Прикрепи полученный результат;


// 3. Создай тип для объекта с информацией о книге: название, автор и количество страниц (по аналогии с type User из примера). 
// Создай объект книги, соответствующий этому типу. Скомпилируй файл в .js. Прикрепи полученный результат.