// 1. Страница /posts:

// - Показывает список 3 постов (можно взять из массива);

// - Каждый пост ведёт на страницу /posts/:id.



// 2. Страница /posts/:id:

// - Показывает ID из URL через useParams.



// 3. На главной странице сделай кнопку "Перейти к постам", которая ведёт на /posts с помощью useNavigate.



// 4. Добавь query-параметры:

// - Если в URL /posts?filter=top, покажи Фильтр: top.



// 5. Добавь страницу 404:

// - Если пользователь ввёл несуществующий адрес, покажи "Страница не найдена".



// 6. Добавь errorElement для одного из маршрутов.

// https://jsonplaceholder.typicode.com/