// 1. Создай переменные для хранения своего города и температуры воздуха в нем на сегодняшний день. 
// Используй эти переменные для вывода информации о своем городе в консоль;

function myCity () { // функция, в которой присваиваются значения переменным и выводятся в консоль
    let city = "Irkutsk"; // переменная, в которой хранится название города
    let temp = 22; // переменная, в которой хранится температура
    console.log(`The temperature in ${city} is currently ${temp} degrees Celsius.`); // вывод в консоль
}

myCity() // вызов функции для отображения результата работы функции

// 2. Напиши выражение, которое вычисляет сумму двух чисел и умножает результат на третье число. 
// Выведи результат в консоль;

const sum = (a, b, c) => (a + b) * c; // функция, которая принимает 3 аргумента и возвращает результат
console.log(sum(2050, 7950, 2)); // выводит результат в консоль

// 3. Используй комментарии, чтобы описать построчно, как работает твой код из предыдущих заданий.



